{
  "personalInfo": {
    "name": "Chuong Tran",
    "email": "chuongtran2001@gmail.com",
    "phone": "+1 (346) 401-8929",
    "location": "Houston, TX, USA",
    "linkedin": "linkedin.com/in/chuongtran2001/",
    "website": "www.chuongtr.com/"
  },
  "experience": [
    {
      "company": "Infodat",
      "role": "Software Developer",
      "startDate": "2024-01",
      "endDate": "Present",
      "location": "Houston, TX, USA",
      "bulletPoints": [
        "Developed and maintained a full-stack application using TypeScript and Java (Spring Boot), streamlining the onboarding of 100+ new facilities and increasing operational capacity by 15% since the start of the fiscal year.",
        "Enhanced backend performance and scalability through service and query optimization, supporting a 15% year-over-year increase in order volume and 8% projected annual revenue growth.",
        "Enhanced front-end workflows and user experience through responsive UI and caching improvements, enabling 20% year-over-year growth in unique users.",
        "Developed reusable D3.js visualization components, cutting chart development time by 70% and promoting UI consistency across internal analytics tools.",
        "Designed and implemented RESTful APIs for RFID-integrated systems, delivering real-time inventory synchronization and improving stock accuracy.",
        "Built event-driven microservices leveraging Google Cloud Pub/Sub, boosting item processing efficiency by 50% and ensuring reliable asynchronous workflows.",
        "Accelerated development speed by 20% through AI-assisted coding tools such as GitHub Copilot, improving productivity and code quality.",
        "Collaborated cross-functionally in an Agile environment, contributing to design discussions, conducting PR reviews, and ensuring high-quality production releases."
      ]
    },
    {
      "company": "Infodat",
      "role": "Software Developer Intern",
      "startDate": "2023-05",
      "endDate": "2023-12",
      "location": "Houston, TX, USA",
      "bulletPoints": [
        "Delivered 5 production-ready features using React and Spring Boot within 10 weeks, directly enhancing user experience and product adoption.",
        "Implemented a CI/CD pipeline with GitHub Actions and AWS EC2, reducing release time and enabling continuous delivery.",
        "Maintained 80% test coverage through unit and integration testing, improving reliability and minimizing bugs."
      ]
    },
    {
      "company": "University of Houston",
      "role": "Teaching Assistant",
      "startDate": "2022-08",
      "endDate": "2023-05",
      "location": "Houston, TX, USA",
      "bulletPoints": [
        "Led weekly lab sessions for 50+ students and designed 20+ hands-on coding challenges in C++, reinforcing key data structures and algorithms concepts."
      ]
    }
  ],
  "education": "file:../resume-sections/education.json",
  "skills": "file:../resume-sections/skills.json",
  "projects": [
    {
      "name": "Brain Tumors Classification",
      "description": "Achieved 91% accuracy in categorizing brain tumors by developing and training a ResNet-50 model on 3,000+ MRI images.",
      "technologies": [
        "Python",
        "Tensorflow",
        "NumPy"
      ]
    },
    {
      "name": "Job Scheduler",
      "description": "Designed and implemented a database-driven cron scheduler in Spring Boot, allowing dynamic task registration and rescheduling at runtime via RESTful APIs.",
      "technologies": [
        "Spring Boot"
      ]
    },
    {
      "name": "Internship Recommender",
      "description": "Implemented a content-based recommendation system to match resumes with relevant job opportunities, and developed a Python/Selenium web-scraping pipeline to ingest 600+ internship listings, enabling large-scale data analysis.",
      "technologies": [
        "Python",
        "NLTK",
        "Selenium",
        "BeautifulSoup"
      ]
    }
  ]
}